[Killed] Multiplication
Discounts/CalorieDiscount.php:16:9
 
     public function getDiscount(Pizza $pizza): float
     {
-        return $pizza->getCalories() * 0.6;
+        return $pizza->getCalories() / 0.6;
     }
 }
killedBy: App\tests\OrderTest::testOrderWithPizzasWithIngredientsAndDiscounts
statusReason: 1) App\tests\OrderTest::testOrderWithPizzasWithIngredientsAndDiscounts
Failed asserting that 1.1333333333333115 matches expected 123.8.

/home/can/code/phpkonf-2023-mutation-testing/demo/tests/OrderTest.php:68

FAILURES!
Tests: 2, Assertions: 3, Failures: 1.
