[Killed] FloatNegation
Discounts/FixedDiscount.php:16:9
 
     public function getDiscount(Pizza $pizza): float
     {
-        return 2.0;
+        return -2.0;
     }
 }
killedBy: App\tests\OrderTest::testOrderWithPizzasWithIngredientsAndDiscounts
statusReason: 1) App\tests\OrderTest::testOrderWithPizzasWithIngredientsAndDiscounts
Failed asserting that 127.8 matches expected 123.8.

/home/can/code/phpkonf-2023-mutation-testing/demo/tests/OrderTest.php:68

FAILURES!
Tests: 4, Assertions: 6, Failures: 1.
