[Killed] Multiplication
Discounts/PercentageDiscount.php:16:9
 
     public function getDiscount(Pizza $pizza): float
     {
-        return $pizza->getCost() * 0.2;
+        return $pizza->getCost() / 0.2;
     }
 }
killedBy: App\tests\OrderTest::testOrderWithPizzasWithIngredientsAndDiscounts
statusReason: 1) App\tests\OrderTest::testOrderWithPizzasWithIngredientsAndDiscounts
Failed asserting that -121.0 matches expected 123.8.

/home/can/code/phpkonf-2023-mutation-testing/demo/tests/OrderTest.php:68

FAILURES!
Tests: 4, Assertions: 6, Failures: 1.
