[Killed] OneZeroFloat
Discounts/ZeroDiscount.php:17:9
 
     public function getDiscount(Pizza $pizza): float
     {
-        return 0.0;
+        return 1.0;
     }
 }
killedBy: App\tests\OrderTest::testOrderWithPizzasWithIngredientsAndDiscounts
statusReason: 1) App\tests\OrderTest::testOrderWithPizzasWithIngredientsAndDiscounts
Failed asserting that 122.8 matches expected 123.8.

/home/can/code/phpkonf-2023-mutation-testing/demo/tests/OrderTest.php:68

FAILURES!
Tests: 4, Assertions: 6, Failures: 1.
