[NoCoverage] UnwrapStrToLower
Ingredients/Dough.php:9:3
 {
 	public function getName(): string
 	{
-		return strtolower('Dough');
+		return 'Dough';
 	}
 

[Killed] FloatNegation
Ingredients/Dough.php:14:3
 
 	public function getCost(): float
 	{
-		return 50.0;
+		return -50.0;
 	}
 
killedBy: App\tests\OrderTest::testOrderWithPizzasWithIngredients
statusReason: 1) App\tests\OrderTest::testOrderWithPizzasWithIngredients
Failed asserting that -98.0 matches expected 102.0.

/home/can/code/phpkonf-2023-mutation-testing/demo/tests/OrderTest.php:38

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] IncrementInteger
Ingredients/Dough.php:19:3
 
 	public function getCalories(): int
 	{
-		return 100;
+		return 101;
 	}
 }
killedBy: App\tests\OrderTest::testOrderWithPizzasWithIngredientsAndDiscounts
statusReason: 1) App\tests\OrderTest::testOrderWithPizzasWithIngredientsAndDiscounts
Failed asserting that 123.2 matches expected 123.8.

/home/can/code/phpkonf-2023-mutation-testing/demo/tests/OrderTest.php:68

FAILURES!
Tests: 3, Assertions: 5, Failures: 1.

[Killed] IntegerNegation
Ingredients/Dough.php:19:3
 
 	public function getCalories(): int
 	{
-		return 100;
+		return -100;
 	}
 }
killedBy: App\tests\OrderTest::testOrderWithPizzasWithIngredientsAndDiscounts
statusReason: 1) App\tests\OrderTest::testOrderWithPizzasWithIngredientsAndDiscounts
Failed asserting that 243.8 matches expected 123.8.

/home/can/code/phpkonf-2023-mutation-testing/demo/tests/OrderTest.php:68

FAILURES!
Tests: 3, Assertions: 5, Failures: 1.
