[Killed] UnwrapStrToLower
Ingredients/Olive.php:9:9
 {
     public function getName(): string
     {
-        return strtolower('Olive');
+        return 'Olive';
     }
 
killedBy: OliveTest::testGetName
statusReason: 1) OliveTest::testGetName
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-'olive'
+'Olive'

[Killed] FloatNegation
Ingredients/Olive.php:14:9
 
     public function getCost(): float
     {
-        return 1.0;
+        return -1.0;
     }
 
killedBy: App\tests\OrderTest::testOrderWithPizzasWithCalories
statusReason: 1) App\tests\OrderTest::testOrderWithPizzasWithCalories
Failed asserting that 100.0 matches expected 102.0.

/home/can/code/phpkonf-2023-mutation-testing/demo/tests/OrderTest.php:49

FAILURES!
Tests: 2, Assertions: 4, Failures: 1.

[Killed] OneZeroFloat
Ingredients/Olive.php:14:9
 
     public function getCost(): float
     {
-        return 1.0;
+        return 0.0;
     }
 
killedBy: App\tests\OrderTest::testOrderWithPizzasWithCalories
statusReason: 1) App\tests\OrderTest::testOrderWithPizzasWithCalories
Failed asserting that 101.0 matches expected 102.0.

/home/can/code/phpkonf-2023-mutation-testing/demo/tests/OrderTest.php:49

FAILURES!
Tests: 2, Assertions: 4, Failures: 1.

[Killed] DecrementInteger
Ingredients/Olive.php:19:9
 
     public function getCalories(): int
     {
-        return 15;
+        return 14;
     }
 }
killedBy: App\tests\OrderTest::testOrderWithPizzasWithIngredientsAndDiscounts
statusReason: 1) App\tests\OrderTest::testOrderWithPizzasWithIngredientsAndDiscounts
Failed asserting that 124.4 matches expected 123.8.

/home/can/code/phpkonf-2023-mutation-testing/demo/tests/OrderTest.php:68

FAILURES!
Tests: 3, Assertions: 5, Failures: 1.

[Killed] IncrementInteger
Ingredients/Olive.php:19:9
 
     public function getCalories(): int
     {
-        return 15;
+        return 16;
     }
 }
killedBy: App\tests\OrderTest::testOrderWithPizzasWithIngredientsAndDiscounts
statusReason: 1) App\tests\OrderTest::testOrderWithPizzasWithIngredientsAndDiscounts
Failed asserting that 123.2 matches expected 123.8.

/home/can/code/phpkonf-2023-mutation-testing/demo/tests/OrderTest.php:68

FAILURES!
Tests: 3, Assertions: 5, Failures: 1.
