[NoCoverage] UnwrapStrToLower
Ingredients/Tomato.php:9:3
 {
     public function getName(): string
     {
-		return strtolower('Tomato');
+		return 'Tomato';
     }
 

[Survived] IntegerNegation
Ingredients/Tomato.php:19:3
 
     public function getCalories(): int
     {
-		return 10;
+		return -10;
     }
 }

[Survived] DecrementInteger
Ingredients/Tomato.php:19:3
 
     public function getCalories(): int
     {
-		return 10;
+		return 9;
     }
 }
