[Killed] PublicVisibility
Order.php:11:2
 {
 	public array $pizzas = [];
 
-	public function addPizza(Pizza $pizza): void
+	protected function addPizza(Pizza $pizza) : void
 	{
 		$this->pizzas[] = ['pizza' => $pizza, 'discount' => null];
killedBy: App\tests\OrderTest::testOrderWithPizzasWithIngredients
statusReason: 1) App\tests\OrderTest::testOrderWithPizzasWithIngredients
Error: Call to protected method App\Order::addPizza() from scope App\tests\OrderTest

/home/can/code/phpkonf-2023-mutation-testing/demo/tests/OrderTest.php:35

2) App\tests\OrderTest::testOrderWithPizzasWithCalories
Error: Call to protected method App\Order::addPizza() from scope App\tests\OrderTest

[Killed] PublicVisibility
Order.php:16:2
 		$this->pizzas[] = ['pizza' => $pizza, 'discount' => null];
 	}
 
-	public function addPizzaWithDiscount(Pizza $pizza, Discount $discount): void
+	protected function addPizzaWithDiscount(Pizza $pizza, Discount $discount) : void
 	{
 		$this->pizzas[] = ['pizza' => $pizza, 'discount' => $discount];
killedBy: App\tests\OrderTest::testOrderWithPizzasWithIngredientsAndDiscounts
statusReason: 1) App\tests\OrderTest::testOrderWithPizzasWithIngredientsAndDiscounts
Error: Call to protected method App\Order::addPizzaWithDiscount() from scope App\tests\OrderTest

/home/can/code/phpkonf-2023-mutation-testing/demo/tests/OrderTest.php:56

ERRORS!
Tests: 4, Assertions: 5, Errors: 1.

[Killed] PublicVisibility
Order.php:21:2
 		$this->pizzas[] = ['pizza' => $pizza, 'discount' => $discount];
 	}
 
-	public function getPizzas(): array
+	protected function getPizzas() : array
 	{
 		return $this->pizzas;
killedBy: App\tests\OrderTest::testOrderWithPizzasWithNoIngredients
statusReason: 1) App\tests\OrderTest::testOrderWithPizzasWithNoIngredients
Error: Call to protected method App\Order::getPizzas() from scope App\tests\OrderTest

/home/can/code/phpkonf-2023-mutation-testing/demo/tests/OrderTest.php:28

ERRORS!
Tests: 4, Assertions: 5, Errors: 1.

[Killed] PublicVisibility
Order.php:26:2
 		return $this->pizzas;
 	}
 
-	public function getPizzasCost(): float
+	protected function getPizzasCost() : float
 	{
 		$cost = 0.0;
killedBy: App\tests\OrderTest::testOrderWithPizzasWithIngredientsAndDiscounts
statusReason: 1) App\tests\OrderTest::testOrderWithPizzasWithIngredientsAndDiscounts
Error: Call to protected method App\Order::getPizzasCost() from scope App\tests\OrderTest

/home/can/code/phpkonf-2023-mutation-testing/demo/tests/OrderTest.php:68

2) App\tests\OrderTest::testOrderWithPizzasWithNoIngredients
Error: Call to protected method App\Order::getPizzasCost() from scope App\tests\OrderTest

[Killed] OneZeroFloat
Order.php:28:3
 
 	public function getPizzasCost(): float
 	{
-		$cost = 0.0;
+		$cost = 1.0;
 
 		// Calculate final price of each pizza. Apply discount if it exists.
killedBy: App\tests\OrderTest::testOrderWithPizzasWithIngredients
statusReason: 1) App\tests\OrderTest::testOrderWithPizzasWithIngredients
Failed asserting that 103.0 matches expected 102.0.

/home/can/code/phpkonf-2023-mutation-testing/demo/tests/OrderTest.php:38

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] Foreach_
Order.php:31:3
 		$cost = 0.0;
 
 		// Calculate final price of each pizza. Apply discount if it exists.
-		foreach ($this->pizzas as $pizza) {
-			$discount = $pizza['discount'];
-			$cost += $pizza['pizza']->getCost() - ($discount ? $discount->getDiscount($pizza['pizza']) : 0.0);
-		}
+		foreach (array() as $pizza) {
 
 		return $cost;
killedBy: App\tests\OrderTest::testOrderWithPizzasWithCalories
statusReason: 1) App\tests\OrderTest::testOrderWithPizzasWithCalories
Failed asserting that 0.0 matches expected 102.0.

/home/can/code/phpkonf-2023-mutation-testing/demo/tests/OrderTest.php:49

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] Ternary
Order.php:33:4
 		// Calculate final price of each pizza. Apply discount if it exists.
 		foreach ($this->pizzas as $pizza) {
 			$discount = $pizza['discount'];
-			$cost += $pizza['pizza']->getCost() - ($discount ? $discount->getDiscount($pizza['pizza']) : 0.0);
+			$cost += $pizza['pizza']->getCost() - ($discount ? 0.0 : $discount->getDiscount($pizza['pizza']));
 		}
 
killedBy: App\tests\OrderTest::testOrderWithPizzasWithIngredientsAndDiscounts
statusReason: 1) App\tests\OrderTest::testOrderWithPizzasWithIngredientsAndDiscounts
Failed asserting that 205.0 matches expected 123.8.

/home/can/code/phpkonf-2023-mutation-testing/demo/tests/OrderTest.php:68

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] OneZeroFloat
Order.php:33:4
 		// Calculate final price of each pizza. Apply discount if it exists.
 		foreach ($this->pizzas as $pizza) {
 			$discount = $pizza['discount'];
-			$cost += $pizza['pizza']->getCost() - ($discount ? $discount->getDiscount($pizza['pizza']) : 0.0);
+			$cost += $pizza['pizza']->getCost() - ($discount ? $discount->getDiscount($pizza['pizza']) : 1.0);
 		}
 
killedBy: App\tests\OrderTest::testOrderWithPizzasWithCalories
statusReason: 1) App\tests\OrderTest::testOrderWithPizzasWithCalories
Failed asserting that 100.0 matches expected 102.0.

/home/can/code/phpkonf-2023-mutation-testing/demo/tests/OrderTest.php:49

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] PublicVisibility
Order.php:39:2
 		return $cost;
 	}
 
-	public function getDiscounts(): array
+	protected function getDiscounts() : array
 	{
 		$discounts = [];
killedBy: App\tests\OrderTest::testOrderWithPizzasWithIngredientsAndDiscounts
statusReason: 1) App\tests\OrderTest::testOrderWithPizzasWithIngredientsAndDiscounts
Error: Call to protected method App\Order::getDiscounts() from scope App\tests\OrderTest

/home/can/code/phpkonf-2023-mutation-testing/demo/tests/OrderTest.php:67

ERRORS!
Tests: 4, Assertions: 5, Errors: 1.

[Survived] Foreach_
Order.php:44:3
 		$discounts = [];
 
 		// Get all discounts from pizzas.
-		foreach ($this->pizzas as $pizza) {
-			/** @var Discount $discount */
-			$discount = $pizza['discount'];
-			if ($discount) {
-				$discounts[] = [$discount->getName(), $discount->getDiscount($pizza['pizza'])];
-			}
-		}
+		foreach (array() as $pizza) {
 
 		return $discounts;

[Survived] IfNegation
Order.php:47:4
 		foreach ($this->pizzas as $pizza) {
 			/** @var Discount $discount */
 			$discount = $pizza['discount'];
-			if ($discount) {
-				$discounts[] = [$discount->getName(), $discount->getDiscount($pizza['pizza'])];
-			}
+			if (!$discount) {
 		}
 

[Survived] ArrayOneItem
Order.php:52:3
 			}
 		}
 
-		return $discounts;
+		return count($discounts) > 1 ? array_slice($discounts, 0, 1, true) : $discounts;
 	}
 

[Killed] PublicVisibility
Order.php:55:2
 		return $discounts;
 	}
 
-	public function getTotalCalories(): int
+	protected function getTotalCalories() : int
 	{
 		$calories = 0;
killedBy: App\tests\OrderTest::testOrderWithPizzasWithCalories
statusReason: 1) App\tests\OrderTest::testOrderWithPizzasWithCalories
Error: Call to protected method App\Order::getTotalCalories() from scope App\tests\OrderTest

/home/can/code/phpkonf-2023-mutation-testing/demo/tests/OrderTest.php:48

ERRORS!
Tests: 4, Assertions: 4, Errors: 1.

[Survived] DecrementInteger
Order.php:57:3
 
 	public function getTotalCalories(): int
 	{
-		$calories = 0;
+		$calories = -1;
 
 		foreach ($this->pizzas as $pizza) {

[Survived] Foreach_
Order.php:59:3
 	{
 		$calories = 0;
 
-		foreach ($this->pizzas as $pizza) {
-			$calories += $pizza['pizza']->getCalories();
-		}
+		foreach (array() as $pizza) {
 
 		return $calories;

[Survived] Assignment
Order.php:60:4
 		$calories = 0;
 
 		foreach ($this->pizzas as $pizza) {
-			$calories += $pizza['pizza']->getCalories();
+			$calories = $pizza['pizza']->getCalories();
 		}
 

[Survived] PlusEqual
Order.php:60:4
 		$calories = 0;
 
 		foreach ($this->pizzas as $pizza) {
-			$calories += $pizza['pizza']->getCalories();
+			$calories -= $pizza['pizza']->getCalories();
 		}
 
