[Killed] MethodCallRemoval
Pizza.php:16:3
 
 	public function __construct()
 	{
-		$this->addIngredient(new Ingredients\Dough());
+		
 	}
 
killedBy: App\tests\OrderTest::testOrderWithPizzasWithNoIngredients
statusReason: 1) App\tests\OrderTest::testOrderWithPizzasWithNoIngredients
Failed asserting that 0.0 matches expected 150.0.

/home/can/code/phpkonf-2023-mutation-testing/demo/tests/OrderTest.php:27

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] IncrementInteger
Pizza.php:19:2
 		$this->addIngredient(new Ingredients\Dough());
 	}
 
-	public function addIngredient(Ingredient $ingredient, int $count = 1): self
+	public function addIngredient(Ingredient $ingredient, int $count = 2) : self
 	{
 		for ($i = 0; $i < $count; $i++) {
killedBy: App\tests\OrderTest::testOrderWithPizzasWithIngredients
statusReason: 1) App\tests\OrderTest::testOrderWithPizzasWithIngredients
Failed asserting that 204.0 matches expected 102.0.

/home/can/code/phpkonf-2023-mutation-testing/demo/tests/OrderTest.php:38

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] PublicVisibility
Pizza.php:19:2
 		$this->addIngredient(new Ingredients\Dough());
 	}
 
-	public function addIngredient(Ingredient $ingredient, int $count = 1): self
+	protected function addIngredient(Ingredient $ingredient, int $count = 1) : self
 	{
 		for ($i = 0; $i < $count; $i++) {
killedBy: App\tests\OrderTest::testOrderWithPizzasWithIngredients
statusReason: 1) App\tests\OrderTest::testOrderWithPizzasWithIngredients
Error: Call to protected method App\Pizza::addIngredient() from scope App\tests\OrderTest

/home/can/code/phpkonf-2023-mutation-testing/demo/tests/OrderTest.php:35

2) App\tests\OrderTest::testOrderWithPizzasWithCalories
Error: Call to protected method App\Pizza::addIngredient() from scope App\tests\OrderTest

[Killed] For_
Pizza.php:21:3
 
 	public function addIngredient(Ingredient $ingredient, int $count = 1): self
 	{
-		for ($i = 0; $i < $count; $i++) {
-			$this->ingredients[] = $ingredient;
-		}
+		for ($i = 0; false; $i++) {
 
 		return $this;
killedBy: App\tests\OrderTest::testOrderWithPizzasWithNoIngredients
statusReason: 1) App\tests\OrderTest::testOrderWithPizzasWithNoIngredients
Failed asserting that 0.0 matches expected 150.0.

/home/can/code/phpkonf-2023-mutation-testing/demo/tests/OrderTest.php:27

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] LessThan
Pizza.php:21:3
 
 	public function addIngredient(Ingredient $ingredient, int $count = 1): self
 	{
-		for ($i = 0; $i < $count; $i++) {
+		for ($i = 0; $i <= $count; $i++) {
 			$this->ingredients[] = $ingredient;
 		}
killedBy: App\tests\OrderTest::testOrderWithPizzasWithNoIngredients
statusReason: 1) App\tests\OrderTest::testOrderWithPizzasWithNoIngredients
Failed asserting that 300.0 matches expected 150.0.

/home/can/code/phpkonf-2023-mutation-testing/demo/tests/OrderTest.php:27

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] PublicVisibility
Pizza.php:28:2
 		return $this;
 	}
 
-	public function getCost(): float
+	protected function getCost() : float
 	{
 		$cost = 0.0;
killedBy: App\tests\OrderTest::testOrderWithPizzasWithNoIngredients
statusReason: 1) App\tests\OrderTest::testOrderWithPizzasWithNoIngredients
Error: Call to protected method App\Pizza::getCost() from scope App\Order

/home/can/code/phpkonf-2023-mutation-testing/demo/src/Order.php:33
/home/can/code/phpkonf-2023-mutation-testing/demo/tests/OrderTest.php:27

2) App\tests\OrderTest::testOrderWithPizzasWithIngredients
Error: Call to protected method App\Pizza::getCost() from scope

[Killed] Foreach_
Pizza.php:32:3
 	{
 		$cost = 0.0;
 
-		foreach ($this->ingredients as $ingredient) {
-			$cost += $ingredient->getCost();
-		}
+		foreach (array() as $ingredient) {
 
 		return $cost;
killedBy: App\tests\OrderTest::testOrderWithPizzasWithNoIngredients
statusReason: 1) App\tests\OrderTest::testOrderWithPizzasWithNoIngredients
Failed asserting that 0.0 matches expected 150.0.

/home/can/code/phpkonf-2023-mutation-testing/demo/tests/OrderTest.php:27

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] Assignment
Pizza.php:33:4
 		$cost = 0.0;
 
 		foreach ($this->ingredients as $ingredient) {
-			$cost += $ingredient->getCost();
+			$cost = $ingredient->getCost();
 		}
 
killedBy: App\tests\OrderTest::testOrderWithPizzasWithIngredientsAndDiscounts
statusReason: 1) App\tests\OrderTest::testOrderWithPizzasWithIngredientsAndDiscounts
Failed asserting that -67.2 matches expected 123.8.

/home/can/code/phpkonf-2023-mutation-testing/demo/tests/OrderTest.php:68

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] PlusEqual
Pizza.php:33:4
 		$cost = 0.0;
 
 		foreach ($this->ingredients as $ingredient) {
-			$cost += $ingredient->getCost();
+			$cost -= $ingredient->getCost();
 		}
 
killedBy: App\tests\OrderTest::testOrderWithPizzasWithIngredients
statusReason: 1) App\tests\OrderTest::testOrderWithPizzasWithIngredients
Failed asserting that -102.0 matches expected 102.0.

/home/can/code/phpkonf-2023-mutation-testing/demo/tests/OrderTest.php:38

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] PublicVisibility
Pizza.php:39:2
 		return $cost;
 	}
 
-	public function getCalories(): int
+	protected function getCalories() : int
 	{
 		$calories = 0;
killedBy: App\tests\OrderTest::testOrderWithPizzasWithCalories
statusReason: 1) App\tests\OrderTest::testOrderWithPizzasWithCalories
Error: Call to protected method App\Pizza::getCalories() from scope App\Order

/home/can/code/phpkonf-2023-mutation-testing/demo/src/Order.php:60
/home/can/code/phpkonf-2023-mutation-testing/demo/tests/OrderTest.php:48

2) App\tests\OrderTest::testOrderWithPizzasWithIngredientsAndDiscounts
Error: Call to protected method App\Pizza::getCalorie

[Killed] Foreach_
Pizza.php:43:3
 	{
 		$calories = 0;
 
-		foreach ($this->ingredients as $ingredient) {
-			$calories += $ingredient->getCalories();
-		}
+		foreach (array() as $ingredient) {
 
 		return $calories;
killedBy: App\tests\OrderTest::testOrderWithPizzasWithIngredientsAndDiscounts
statusReason: 1) App\tests\OrderTest::testOrderWithPizzasWithIngredientsAndDiscounts
Failed asserting that 192.8 matches expected 123.8.

/home/can/code/phpkonf-2023-mutation-testing/demo/tests/OrderTest.php:68

FAILURES!
Tests: 4, Assertions: 6, Failures: 1.

[Killed] Assignment
Pizza.php:44:4
 		$calories = 0;
 
 		foreach ($this->ingredients as $ingredient) {
-			$calories += $ingredient->getCalories();
+			$calories = $ingredient->getCalories();
 		}
 
killedBy: App\tests\OrderTest::testOrderWithPizzasWithIngredientsAndDiscounts
statusReason: 1) App\tests\OrderTest::testOrderWithPizzasWithIngredientsAndDiscounts
Failed asserting that 183.8 matches expected 123.8.

/home/can/code/phpkonf-2023-mutation-testing/demo/tests/OrderTest.php:68

FAILURES!
Tests: 4, Assertions: 6, Failures: 1.

[Killed] PlusEqual
Pizza.php:44:4
 		$calories = 0;
 
 		foreach ($this->ingredients as $ingredient) {
-			$calories += $ingredient->getCalories();
+			$calories -= $ingredient->getCalories();
 		}
 
killedBy: App\tests\OrderTest::testOrderWithPizzasWithIngredientsAndDiscounts
statusReason: 1) App\tests\OrderTest::testOrderWithPizzasWithIngredientsAndDiscounts
Failed asserting that 261.8 matches expected 123.8.

/home/can/code/phpkonf-2023-mutation-testing/demo/tests/OrderTest.php:68

FAILURES!
Tests: 4, Assertions: 6, Failures: 1.
