4) /home/can/code/phpkonf-2023-mutation-testing/demo/src/Order.php:44    [M] Foreach_

--- Original
+++ New
@@ @@
     {
         $discounts = [];
         // Get all discounts from pizzas.
-        foreach ($this->pizzas as $pizza) {
+        foreach (array() as $pizza) {
             /** @var Discount $discount */
             $discount = $pizza['discount'];
             if ($discount) {

5) /home/can/code/phpkonf-2023-mutation-testing/demo/src/Order.php:47    [M] IfNegation

--- Original
+++ New
@@ @@
         foreach ($this->pizzas as $pizza) {
             /** @var Discount $discount */
             $discount = $pizza['discount'];
-            if ($discount) {
+            if (!$discount) {
                 $discounts[] = [$discount->getName(), $discount->getDiscount($pizza['pizza'])];
             }
         }

6) /home/can/code/phpkonf-2023-mutation-testing/demo/src/Order.php:48    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
             /** @var Discount $discount */
             $discount = $pizza['discount'];
             if ($discount) {
-                $discounts[] = [$discount->getName(), $discount->getDiscount($pizza['pizza'])];
+                $discounts[] = [$discount->getDiscount($pizza['pizza'])];
             }
         }
         return $discounts;

7) /home/can/code/phpkonf-2023-mutation-testing/demo/src/Order.php:52    [M] ArrayOneItem

--- Original
+++ New
@@ @@
                 $discounts[] = [$discount->getName(), $discount->getDiscount($pizza['pizza'])];
             }
         }
-        return $discounts;
+        return count($discounts) > 1 ? array_slice($discounts, 0, 1, true) : $discounts;
     }
     public function getTotalCalories() : int
     {

9) /home/can/code/phpkonf-2023-mutation-testing/demo/src/Order.php:59    [M] Foreach_

--- Original
+++ New
@@ @@
     public function getTotalCalories() : int
     {
         $calories = 0;
-        foreach ($this->pizzas as $pizza) {
+        foreach (array() as $pizza) {
             $calories += $pizza['pizza']->getCalories();
         }
         return $calories;
     }
 }
